In [1]:
import pandas as pd

In [2]:
df_01 = pd.read_csv('../data/zippedData/bom.movie_gross.csv.gz')

In [3]:
df_04 = pd.read_csv('../data/zippedData/imdb.title.basics.csv.gz')

In [4]:
df_07 = pd.read_csv('../data/zippedData/imdb.title.ratings.csv.gz')

In [15]:
df_11 = pd.read_csv('../data/zippedData/tn.movie_budgets.csv.gz')

In [16]:
df_09 = pd.read_csv('../data/zippedData/rotten_tomatoes_movies.csv.gz')

In [5]:
df_01.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [8]:
df_01.shape

(3387, 5)

In [6]:
df_04.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [9]:
df_04.shape

(146144, 6)

In [7]:
df_07.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [10]:
df_07.shape

(73856, 3)

Data sets to try and merge below

In [12]:
merge_01 = pd.merge(df_07,df_04)

In [13]:
merge_01.head()

,tconst,averagerating,numvotes,primary_title,original_title,start_year,runtime_minutes,genres
0,tt10356526,8.3,31,Laiye Je Yaarian,Laiye Je Yaarian,2019,117.0,Romance
1,tt10384606,8.9,559,Borderless,Borderless,2019,87.0,Documentary
2,tt1042974,6.4,20,Just Inès,Just Inès,2010,90.0,Drama
3,tt1043726,4.2,50352,The Legend of Hercules,The Legend of Hercules,2014,99.0,"Action,Adventure,Fantasy"
4,tt1060240,6.5,21,Até Onde?,Até Onde?,2011,73.0,"Mystery,Thriller"

In [14]:
merge_01.shape

(73856, 8)

In [25]:
merge_01.to_csv('../data/zippedData/Processed/merge1.csv')

In [4]:
df_01 = pd.read_csv('../data/zippedData/bom.movie_gross.csv.gz')

In [5]:
df_01.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [9]:
data_g = df_01.drop(['title','foreign_gross', 'year'], axis=1)

In [10]:
data_g.head()

  studio  domestic_gross
0     BV     415000000.0
1     BV     334200000.0
2     WB     296000000.0
3     WB     292600000.0
4   P/DW     238700000.0

In [12]:
data_g.to_csv('../data/zippedData/Processed/third_graph.csv')